app/controllers/movies_controller.rb

  def index
    debugger
    params[:order]
    @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (id = 1)