app/controllers/movies_controller.rb


    @checked_ratings = @checked_ratings_hash != nil ? @checked_ratings_hash.keys : [] #makes sure that the checked boxes match the stuff showing
    @search_ratings = @checked_ratings.empty?() ? @all_ratings : @checked_ratings # sets them all to checked in the begining
    @movies = Movie.find_all_by_rating(@search_ratings, :order => @sorted_field) #allows you to have sorted movies
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')